#равномерно разпределение - равномерно разпределени случайни величини в интервал [a,b]
#функцията unif() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)

#100 случайни равномерно разпределени величини в интервала [0,2]
x = runif(n = 100, min = 0, max = 2)
hist(x, probability=TRUE, col=gray(.9), main="uniform on [0,2]") #хистограма на разпределението
curve(dunif(x,0,2),add=T) #теоретична плътност -> dunif(x,0,2) всяка от случайните величини с каква вероятност да се случи е 

#генериране на извадка -> измежду числата x (от 1 до х, ако х е число, а не вектор), се взимат по случаен начин size числа
sample(x = 1:10, size = 10) 
sample(x = 10, size = 10, replace = TRUE) #може да има повторения


#геометрично разпределение - частен случай на отрицателно биномното, кoгато искаме да имаме x неуспеха преди първия успех с вероятност за успех prob
#функцията geom() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)
Y=0:10
plot(Y, dgeom(x = Y, prob = 0.6), type="h", ylim=c(0,1), main="Geometric distribution for p=0.6", ylab="P(Y=Y)", xlab="Y=Number of failures before first success")

#екцпоненциално разпределение - непрекъсната случайна величнина
#функцията exp() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)
mu = 2500
x = rexp(n = 100, rate = 1/mu) #100 случайни експоненциално разпределени величини с вероятност 1/mu
hist(x,probability=TRUE,col=gray(.9),main="exponential mean=2500") #хистограма
curve(dexp(x = x, rate = 1/2500),add=T) #теоретична плътност

#нормално разпределение - очакване(средно) mu и дисперсия sigma (стандартно отклонение sigma)
#функцията norm() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)
#на финкцията се подава очакване (mu) и стандартно отклонение (sigma)
x=c(1:200)
plot(dnorm(x, 100,10), ylim=c(0,0.1))
lines(dnorm(x, 100,5), col="red")
lines(dnorm(x, 130,10), col="blue")

#стандартно нормално разпределение - нормално разпределение с очакване 0 и дисперсия 1
#по подразбиране в norm(x, mu = 0, sd = 1)
#за нормализиране се използва формулата y = (x - mu)/sigma 
#където х е нормално разпределена случайна величина с очакване mu и дисперсия sigma^2,
#а у е стандарна нормално разпределене случайна величина


#-----------------------------------------------------

#01
#геометрично разпределение с вероятност 1/2, 1/3, 2/3
y=0:10 #случайни числа(за онагледяване)
plot(x = y, dgeom(x = y, prob = 1/2), ylim=c(0,0.8), ylab = "Probability", xlab = "Number of fails before the first success")
lines(x = y, dgeom(x = y, prob = 1/3), col="red")
lines(x = y, dgeom(x = y, prob = 2/3), col="blue")

#02
#експоненциално разпределение с mu =5
k.30 = dexp(x = 5, rate = 1/5)
plot(x = 1:30, y = dexp(x = 1:30, rate = 1/5), main = "Exponentila with mu = 5", ylab = "P(X = x)")

#03
x = rnorm(n = 50, mean = 5, sd = 5) #N(5,5) означава дисперсия 5 = sigma^2 => стандартно отклонение sigma = sqrt(5), но в случая няма значение :) 
x.norm = (x - 5)/5
hist(x.norm, probability = TRUE)
x.standart = rnorm(50)
hist(x.standart, probability = TRUE)

#04
#z стандартно нормално разоределена случайна величина
pnorm(q = 0.92 , lower.tail = FALSE) #P(Z > 0.92)
pnorm(q = -0.5, lower.tail = FALSE) #P(Z > -0.5) = P(Z < 0.5)
#P(-0.64 < Z < 0.43) = P(Z < 0.43) - P(Z > -0.64)
pnorm(0.43) - pnorm(-0.64, lower.tail = FALSE)

#05
#x нормално разпределено с mu = 3 и sigma^2 = 4
pnorm(q = 6.2, mean = 3, sd = 2)

#06
pnorm(q = 3100, mean = 3500, sd = 500)
pnorm(-4/5) #нормирано z = (3100 - 3500)/500 = -4/5 е стандартно нормално разпределено N(0,1)

#07
#X = N(80, 10^2), Y=N(78, 13^2) => X-Y = N(80-78, 10^2 + 13^3) = N(2,269)
pnorm(0,2,sqrt(269),lower.tail = FALSE) #искаме Х > Y => X - Y > 0

