

#-----------------------------------------------------

#01
x=iris[,1:4]
cor(x)
pairs(x)

#02
#Kz ковариация на X=(X1, X2, X2) -> по диагонала е DXi = E(Xi^2) - (EXi)^2
#другите елементи на матрицата са ковариацията на елементите два по два
Kz = matrix(c(16, -14, 12, -14, 49, -21, 12, -21, 36), ncol = 3, byrow = TRUE)
cor(Kz) #като че ли не го смята никак правилно
#супер грозен начин за решаване, но май е по-верен? :)
cov.X1.X2 = Kz[1,2] / sqrt(Kz[1,1]*Kz[2,2])
cov.X1.X3 = Kz[1,3] / sqrt(Kz[1,1]*Kz[3,3])
cov.X2.X3 = Kz[2,3] / sqrt(Kz[2,2]*Kz[3,3])
cov.X = matrix(c(1, cov.X1.X2, cov.X1.X3, cov.X1.X2, 1, cov.X2.X3, cov.X1.X3, cov.X2.X3, 1), ncol = 3, byrow = TRUE)
