#биномно разпределение - n независими опита с вероятност за успех на всеки p и за провал 1-p=q
#dbinom - Р(X = x)
x <- seq(0,50,by=1) 
y <- dbinom(x = x, size = 50, prob = 0.2) #вероятността да имаш x успешни опита от общо size опита с вероятност за усех prob
plot(x,y)
y <- dbinom(x = x, size = 50,prob = 0.5)
plot(x,y)

#pbinom - P(X <= x)
pbinom(q = 24, size = 50, prob = 0.5) #вероятността да имаш по-малко или равно на q успеха от общо size опита с вероятност за усех prob
pbinom(q = 25, size = 50, prob = 0.5, lower.tail = FALSE) #P(X>x) -> вероятността да имаш повече от q успеха от общо size опита с вероятност за усех prob

#qbinom - по зададена вероятност намира колко успеха от size опита с вероятност за успех prob е имало (обратното на dbinom) 
qbinom(p = 0.4438624,size = 50, prob = 1/2)
qbinom(p = 0.5561376,size = 50, prob = 0.5)

#rbinom за генериране на n случайно разпределени величини от 0 до size с вероятноса за успех prob 
rbinom(n = 5, size = 10, prob = 0.2)
rbinom(n = 5, size = 100,prob = 0.2)


#отрицателно биномно разпределение - колко неусеха да получаване на фиксиран брй успехи 
#dnbinom - вероятността да има x неуспеха да получаването на size-тия успех с вероятност за успех prob
dnbinom(x = c(1:10), size = 5, prob = 0.5) 

#pnbinom 
pnbinom(q = 8, size = 3, prob = 0.2) #вероятността да има по-малко или равно на q неуспеха дo получаването на size-тия успех с вероятност за успех prob
pnbinom(q = 8, size = 3, prob = 0.2, lower.tail = FALSE) #повече от q неуспеха до получаването на size-тия успех с вероятност за успех prob

#qnbinom и rnbinom аналогични на qbinom и rbinom


#Хипергеометрично разпределение - N обекта, M от тях са маркирани, по случаен начин избираме n на брой. X - броят на маркираните, измежду тези които сме избрали случайно
#функцията hyper() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)
success=c(0:6)
dhyper(x = success, m = 6, n = 30, k = 6)

#Поасоново разпределение - биномно разпределение, което има много малка вероятност
#n->inf, p->0, np = lamda
#Функция pois() c префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)
ppois(q = 16, lambda = 12)


#-----------------------------------------------------

#01
#биномно разпределение n=79, k=29, p=1/2
result = choose(79,29) * 1/(2^29) * 1/(2^50) #choose смята биномен коефициент
result.binom = dbinom(x = 29, size = 79, prob = 1/2)

#02
not.fixed = pbinom(q = 2, size = c(3,4,5,7,8), prob = 1/2) #по-малко или равно на size опита за изтегляне на 2 езита
fixed = dbinom(x = 2, size = c(3,4,5,7,8), prob = 1/2) #точно size опита за изтегляне на 2 езита

plot(x= c(3,4,5,7,8), y = not.fixed, type = "l", main = "Dstribution of two ezi", xlab = "Number of tries", ylab = "Probability")
lines(x= c(3,4,5,7,8), y = fixed, type = "p", col = "red")

#03
#оцелването на тройка е биномно разпределена случайна величина с вероятност за успех p = 0.7
n = qbinom(p = 1 - 0.18522, size = 3, prob = 0.7 ) + 3 #???

x = qbinom(p = 0.18522, size = c(3:10), prob = 0.7 ) #с вероятност 0.18522 проверяваме от 3 до няколко(10) опита на кой опит ще е уцелил три пъти
names(x) = c(3:10)
result = as.numeric(names(x[x == 3]))  
# => на 5-ти и 6-ти опит ще е оцелил три тройки с вероятност 0.18522

#04
#вероятността да има <=35 жени в извадка от k = 100 човека, като жените са m = 40% от 600000 човека, а мъжете са n = 60% от 600000 човека
theoretical = phyper(q = 35, m = 0.4*600000, n = 0.6*600000, k = 100)
pop = rep(c(0,1),c(360000, 240000)) #симулираме 600000 човека -> 360000 нули за мъжете и 240000 единици за жените
res=sapply(c(0:1000), function(x) sum(sample(pop,100))) # 1000 елементен вектор с резултатите за общия брой жени в случайна извадка от 100 човека
empirical = sum(res<=35)/100

#05
#поасоново разпределение с ламда = 2 обаждания за минута
# => поасоново разпределенеи с ламда = 2*5 = 10 обаждания за 5 минути
exactly.2 = dpois(x = 2, lambda = 10) # P(X = 2)
less.than.2 = ppois(q = 1, lambda = 10) # P(X <= 1) = P(X < 2)
more.than.2 = ppois(q = 1, lambda = 10, lower.tail = FALSE) # P(X > 1) = P(X >= 2)

#06
#отрицателно биномно разпределение с вероятност за успех 4/52 (4 аса от 52 карти)
#търсим вероятността за 4 провала до първия успех => 5-тата изтеглена карта е асо
dnbinom(x = 4, size = 1, prob = 4/52)
dgeom(x = 4, prob = 4/52)
