#хипотези
#имаме случайна величина X, която е с някакво разпределение, но не знаем някой параметър tita
#формулираме хипотеза Ho: tita = нещо срещу алтернатива Н1:tita =/= нещо / Н1:tita < нещо / Н1:tita > нещо
#грешка от първи род: хипотезата е вярна, но ние я отхвърляме
#грешка от втори род: хипотезата е грешна, но ние я приемаме
#alpha-ниво на значимост -> най-голята вероятност, с която можем да допуснем грешка от първи род
#p-value - измерва вероятността за близост на измерваното разпределение до приетата за вярна нулева хипотеза
#ако p-value е по-малко от 1 - alpha (1 - alpha в случая е малко число - възможност за грешка(0.05) ) -> отхвърляме нулевата хипотеза (значи е вярна алтернативана)
#ако p-value е по-голямо от 1 - alpha -> не можем да отхвърлим нулевата хипотеза (значи е вярна хипотезата)

#сравняване на пропорции - проверява дали пропорцията на една нормално разпределена група отговаря на пропорцията в друга нормално разпределена група
#функция prop.test() -> с conf.level може да се зададе ниво на значимост (по подразбиране е 0.95), alternative = c("two.sided", "less", "greater") - H1: =/= или < или >
#подава се вектор с брой успехи или двумерна матрица с две колони, задаваща броя успехи и неуспехи 
sexsmoke<-matrix(c(70,120,65,140),ncol=2,byrow=T)
rownames(sexsmoke)<-c("male","female")
colnames(sexsmoke)<-c("smoke","nosmoke")
#H0: двете групи имат еднакви пропорции
#H1: двете групи нямат еднакви пропорции
prop.test(sexsmoke) #p-value е по-голямо от 0.05, значи отхвърляме нулевата хипотеза -> нямат еднакви пропорции
prop.test(c(70,65),c(190,205)) # Идентично изпълнение
prop.test(c(70,65),c(190,205),conf.level=0.99) # смяна на нивото на значимост
prop.test(c(70,65),c(190,205),c(0.33,0.33)) # предварително заложени пропорциии

#t-тест - при анализ на очакването за извадка с неизвестни очкаване(mu) и средно отклонение(sigma)
#функцията t.test(x, mu, alternative = c("two.sided", "less", "greater")) проверява хипотезата  H0: очакването да е равно на mu срещу алтернативата H1: =/= или < или >
mpg= c(11.4,13.1,14.7,14.7,15.0, 15.5,15.6,15.9,16.0,16.8)
#пресмятане на ръка, което не е нужно
xbar=mean(mpg); s=sd(mpg); n=length(mpg)
SE=s/sqrt(n)
est=(xbar-17)/SE
pt(est,df=n-1, lower.tail=T)
#автоматично пресмятане
#H0: mu = 17
#H1: mu < 17
t.test(mpg,mu=17,alt="less") #p-value e много по-мално от 0.05, значи не можем да отхвърлим нулевата хипотеза -> е вярно че очакването на тази извадка е 17

#тестове с медиани - когато голяма част от измерените стойности са струпани в едния край, но има и няколко в другия край, статистическото очакване (mean(xi)) ще даде неточни резултати, затова ползваме медина вместо очакване
#функцията wilcox.test(x,y,alternative) се използва, когато се оценява медианата (а не очакването)
#също в повторни измервания X и Y , когато се сравняват данните поелементно
#H0: данните са еднакви X = Y
#H1: X=/=Y или X<Y или X>Y

#хи-квадрат тест - ползва се за проверяване на goodness of fit и зависимост на случайни величини
#функцията chisq.test()
#goodness of fit: chisq.test(x, p , rescale.p = TRUE) -> проверява х (вектор от вероятности за наблюдавани стойности), колко са близо по разпределение към p (вектор от други наблюдавани или теоретични вероятности), сбора на p трябва да равен на 1, ако не е rescale.p = TRUE (или се добавя още една стойност, съдържаща 1 - sum(p))
#колкото по-голямо е p-value -> толкова по-добър е goodness of fit-a
#зависимост на случайни велични: chisq.test(matrix) -> matrix съдържа два реда със стойностите на величините, които искаме да проверим дали са завсими
#H0: величините са независими
#Н1: величините са зависими
#ако p-value е по-малко от 1-alpha (alpha - ниво на значимост), значи отхвърляме нулевата хипотеза -> величините са зависими
#ако p-value е по-голямо от 1-alpha (alpha - ниво на значимост), значи не можем да отхвърлиме нулевата хипотеза -> величините са независими

#f-тест - когато диспериите на две извадки са значително различни sigma1^2 и sigma2^2
#H0: sigma1^2 = sigma2^2 
#H1: sigma1^2 < sigma2^2 или sigma1^2 > sigma2^2 или sigma1^2 =/= sigma2^2 
#функция var.test()
#???
F = 3^2 / 2^2 # F - statistics
df(F,9,14) # p-value
qf(0.975,9,14)

#quantil-quantil plot - графичен метод за определяне дали две извадки произхождат от множества с еднакви разпределения
#функция qqplot(x,y) - ако искаме да сравним разппределението на извадките x и y
#финкция qqnorm(x) - ако искаме да сравним извадката х с нормално разпределение
y <- rnorm(2000)*4
qqnorm(y) #сравняваме y (стандартно нормално разпределено) с нормално разпределение
qqline(y, col = 2,lwd=2,lty=2) #ако точните много се изкривяват от тази права, значи не са еднакво разпределени

y <- rnorm(2000)*4 - 4
qqnorm(y)
qqline(y, col = 2,lwd=2,lty=2)

y <- rexp(2000,1)
qqnorm(y) #сравняваме у (експоненциално разпределение) с нормално разпределение
qqline(y, col = 2,lwd=2,lty=2) #точките много се разминават от правата -> доказателство, че не са еднакво разпределени

x <- rpois(2000,1)
y <- rbinom(2000,size=10,prob=1/10)
qqplot(x,y) #сравняваме х(поасоново разпределение) с у(биномно разпределение)
qqline(y, col = 2,lwd=2,lty=2)

y <- rbinom(2000,size=10,prob=1/2)
qqplot(x,y)
qqline(y, col = 2,lwd=2,lty=2)


#-----------------------------------------------------

#01
library("MASS")
q = quine
tb=table(q$Eth,q$Sex)
prop.test(tb, correct=FALSE)

#02
x=c(170, 167, 174, 179, 179, 156, 163, 156, 187, 156, 183, 179, 174, 179, 170, 156, 187, 179, 183, 174, 187, 167, 159, 170, 179)
#H0: m = 170 and H1:m < 170
t.test(x,mu=170,alt="less")
#H0: m=170 and H1:m > 170
t.test(x,mu=170,alt="greater")

#03
x=c(7.65, 7.60 ,7.65, 7.70, 7.55, 7.55, 7.40, 7.40, 7.50, 7.50)
m=7.5
t.test(x,mu=m,alt="two.sided")

#04
x = c(12.8,3.5,2.9,9.4,8.7,0.7,0.2,2.8,1.9,2.8,3.1,15.8)
#H0: медианата = 5
#H1: медианата > 5
wilcox.test(x,mu=5.0,alt="greater")

#05
library("MASS")
tbl = table(survey$Smoke, survey$Exer)
chisq.test(tbl)

#По-добра оценка
ctbl = cbind(tbl[,"Freq"], tbl[,"None"] + tbl[,"Some"])
chisq.test(ctbl)

#06
#вариант 1
n=567
k = seq(0,5)
nk=c(229,221,93,35,7,1)
lambda = 0.93
nn=nk/n
pk = dpois(k,lambda)
pk[7] = 1 - sum(pk)
chi2 = sum(((nk - n*pk)^2)/n*pk)
pchisq(chi2,df = 5, lower.tail = FALSE)

#вариант 2
n=c(229,221,93,35,7,1)
nn=n/sum(n)
p=dpois(0:4,0.93)
p[6] = 1 - sum(p)
chisq.test(nn,p = p)

#07
a = rnorm(100,0,1)
b = rnorm(100,1,1)
var.test(a,b)
