#X = X1,..Xn - експериментално получени случайни величини
#математическо очакване Е(X) = mean(X) (mu)
#дисперсия D(X) = var(x)  (sigma^2)
#стандартно отклонение s = sd(x)  (sigma)
x = c(74, 122, 235, 111, 292, 111, 211, 133, 156, 79)
mean(x) #очакване
var(x) #дисперсия
sd(x) #стандартно отклонение

#централна гранична теорема - когато имаме много независими еднакво разпределенислучайни величини X1,..Xn, то сумата им след нориране е стандартна нормално разпределена велинина
#Y = ( sum(Xi) - E(sum(Xi)) ) / sqrt( D(sum(xi)) ) e стандартно нормално разпределена случайна величина
#E(sum(Xi)) = sum(EXi)  -> очакването на сума е сума от очакванията
#D(sum(Xi)) = sum(DXi)  -> дисперсия на сума е сума от дисперсиите

#твърдение: Xi = N(mu, sigma^2) - Xi случайни нормално разпределени величини с очакване mu и дисперсия sigma^2
#Xn.cherta = N(mu, (sigma^2)/n ) -> Xn.cherta = sum(Xi)/n -> статистическо средно e нормално разпределено с очакване mu и дисперсия (sigma^2)/n

#хи-квадрат разпределение
#Y1,..,Yn стандартно нормално разпределени случайни величини N(0,1)
#X^2(r) = sum(Yi^2) e хи-квадрат разпределение с r степени на свобода
#функцията chisq() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)

#t-разпределение
#X = X1,...,Xn n независими измервания Xi, очакване mu, извадково средно mean(x), oценка за стандартно отклонение sd(x) и неизвестно sigma 
#най-добрата оценка за неизвестното sigma се дава с t-разпределение с n-1 степени на свобода
#функцията t() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)

#f-разпределение - непрекъснато статистическо разпределение, получено от отношението на две хи-квадрат разпределения
#Fn,m = (X^2(n)/n) / (X^2(m)/m)
#тества дали две извадки имат еднаква дисперсия
#функцията f() с префикси d,p,q,r за съответно плътност, разпределние, квантил и случайно разпределение(симулиране)


#-----------------------------------------------------

#01
#x1=Bi(100,1/2), x2=Bi(100,1/3)
cgt.binom = function(n,p) {
    xi = rbinom(n = 100, size = n, prob = p)
    EXi = n * p #EXi = n*p -> очакване за биномно разпределени величини
    DXi = n * p * (1-p) #DXi = n*p*q = n*p*(1-p) -> дисперсия за биномно разпределени велчини
    x1.norm = (xi - EXi) / sqrt(DXi) #нормираме всички величини
    hist(x = x1.norm, probability = TRUE)
    x = rnorm(100)  #симулираме нормално разпределени величини за да сравним 
    curve(dnorm(x), add = T)  #приличат си доста, значи и графично можем да кажем че е изпълнена централната гранична теорема
}
cgt.binom(100,1/2)
cgt.binom(100,1/3)

#02
temp = c(102.5, 101.7, 103.1, 100.9, 100.5, 102.2)
sd = 1.2
x=mean(temp)
alpha=1-0.95
z=qnorm(1-alpha/2)
lower=x-z*sd
upper=x+z*sd

#03
#1000 случайни нормално разпределени величини N(2,2)
x = rnorm(n = 1000, mean = 2, sd = sqrt(2))
alpha=1-0.95
z=qnorm(1-alpha/2)
x.cherta=mean(x)
#N(mu,1) -> formula 10
x.lower=x.cherta-z*1
x.upper=x.cherta+z*1
plot(x)
lines(x=0:1000,y=rep(x.upper,1001), col='red')
lines(x=0:1000,y=rep(x.lower,1001), col='blue')

x.l=length(x[x>=lower&x<=x.upper])
mean(x[x>=lower&x<=x.upper])
x.pro=x.l/10

#N(2,1)
y=rnorm(n=1000, mean=2, sqrt(1))
alpha=1-0.95
z=qnorm(1-alpha/2)
y.cherta=mean(y)
#N(mu,1) -> formula 10
y.lower=y.cherta-z*1
y.upper=y.cherta+z*1
plot(y)
lines(x=0:1000,y=rep(y.upper,1001), col='red')
lines(x=0:1000,y=rep(y.lower,1001), col='blue')

y.l=length(y[y>=lower&y<=y.upper])
mean(y[y>=lower&y<=y.upper])
y.pro=y.l/10

#04

